{
  "Navigation": {
    "home": "Home",
    "projects": "Projects"
  },
  "Index": {
    "title": "IT engineer and developer",
    "about-me": "<p>Web developer with over a year of experience in software engineering. My core stack consits of <t>React.js</t>, <t>Next.js</t>, <t>TypeScript</t>, <t>SCSS</t>, <t>MySQL</t> and <t>Prisma</t>. Additionally, during my studies and while creating personal projects I learned other technologies, such as <t>C#</t>, <t>.NET</t>, <t>Java</t>, <t>Spring</t> and <t>React Native</t>.</p><p>As of recentely, I have also been gaining knowledge in the field of artificial intelligence and machine learning, focusing on the domain of language processing. I gained experience in <t>Python</t>, <t>PyTorch</t> and <t>Pandas</t> by developing a customer service chatbot based on a Large Language Model called <t>Llama 2</t>.</p>",
    "experience": {
      "header": "Experience",
      "items": [
        {
          "company": "Paidwork",
          "title": "Intern AI/ML Engineer",
          "companyUrl": "https://www.paidwork.com/",
          "companyImg": "/paidwork.png",
          "location": "Remote, Poland",
          "achievements": [
            "Assisted in building a chatbot based on Mistral LLM, which constituted the first line of support for users communicating with the customer service department.",
            "Created and processed datasets by using uncategorized data collected by the company."
          ],
          "startingDate": "November 2023",
          "endingDate": "March 2024"
        },
        {
          "company": "HTD Health",
          "title": "Junior Web Developer",
          "companyUrl": "https://htdhealth.com/",
          "companyImg": "https://htdhealth.com/wp-content/themes/htd/assets/svg/logo-white.svg",
          "location": "Łódź, Poland",
          "achievements": [
            "Introduced Sentry as a performance measuring and error-tracking tool for the project, which helped with detecting and fixing errors, making the website more reliable.",
            "Prototyped a functionality of automatically creating, filling with data, and sending documents to doctors using DocuSign API, which greatly simplified the process of obtaining documentation for the user.",
            "Developed a ReactJS hook for saving, retrieving, and validating data stored in local storage, improving user experience by persisting form information, even after the website was closed.",
            "Refactored the project to implement accessible and semantic HTML and CSS to comply with WCAG 2.1."
          ],
          "startingDate": "October 2022",
          "endingDate": "January 2023"
        },
        {
          "company": "HTD Health",
          "title": "Intern Web Developer",
          "companyUrl": "https://htdhealth.com/",
          "companyImg": "https://htdhealth.com/wp-content/themes/htd/assets/svg/logo-white.svg",
          "location": "Łódź, Poland",
          "achievements": [
            "Assisted the engineering team in maintaining and developing a web catalog project.",
            "Ensured code clarity, consistency, and correctness by regularly performing code review of pull requests created by other team members."
          ],
          "startingDate": "June 2022",
          "endingDate": "September 2022"
        }
      ]
    },
    "most-recent-project": {
      "header": "Most recent project",
      "more-work": "To see more of my work, click here:",
      "portfolio-button": "Full portfolio"
    },
    "contact": {
      "header": "Contact",
      "email": "artur.pietrzak1@outlook.com",
      "github": "/arturpietrzak",
      "linkedin": "/artur-pietrzak-dev"
    }
  },
  "Projects": [
    {
      "title": "Knowledge sharing platform",
      "description": "A twitter-inspired social networking site with focus on longer, formattable posts and sharing knowledge.",
      "id": "knowhow",
      "imageUrl": "/projects/knowhow.webp",
      "tags": ["React.js", "Next.js", "tRPC", "Prisma"]
    },
    {
      "title": "Digit Recognition",
      "description": "Digit recognition system trained using MNIST database. Model uses Convolutional Neural Network with an accuracy of approximately 98.84%.",
      "id": "digit-recognition",
      "imageUrl": "/projects/digit.webp",
      "tags": ["TensorFlow 2.0", "Keras", "Flask", "React.js"]
    },
    {
      "title": "This personal website",
      "description": "Personal website was created as a portfolio to showcase my works and experience.",
      "id": "personal-website",
      "imageUrl": "/projects/personal.webp",
      "tags": ["React.js", "Next.js", "Framer Motion"]
    },
    {
      "title": "Racetrack Ranking",
      "description": "Web platform for viewing, commenting and rating race tracks all over the world.",
      "id": "racetrack-ranking",
      "imageUrl": "/projects/racetrack.webp",
      "tags": ["Express.js", "React.js"]
    },
    {
      "title": "Weather app",
      "description": "A web app for showing current and future weather in a place entered by the user. Utilizes visualcrossing.com weather API.",
      "id": "weather-app",
      "imageUrl": "/projects/weather.webp",
      "tags": ["React.js", "Axios"]
    },
    {
      "title": "Commutely",
      "description": "A project created with a mission to educate people on the true costs of car transport, both economic and environmental.",
      "id": "commutely",
      "imageUrl": "/projects/commutely.webp",
      "tags": ["Bootstrap", "HTML", "CSS", "JS"]
    }
  ],
  "ProjectPage": {
    "view-project": "View source code on github",
    "knowhow": {
      "tags": ["React.js", "Next.js", "tRPC", "Prisma"],
      "youtube-id": "ATsU1MizZLM",
      "title": "Knowledge-sharing social media platform",
      "github-link": "https://github.com/arturpietrzak/EngineeringThesis",
      "description": "<p>Fully functional social media platform built using <e>T3 Stack</e> (<e>React.js</e>, <e>Next.js</e>, <e>tRPC</e>, <e>NextAuth.js</e> and <e>Prisma</e>). The database component was created using <e>MySQL</e> and hosted on <e>PlanetScale</e>. The UI was created with <e>MantineUI</e>. The platform is split into two main parts - the user application and administative panel.</p><p>The user application allows anyone to view post created by others using different content exploration methods - main page (with recent posts), trending page, topic page and search page. User can also create an account and customize it by changing the profile description, setting profile picture and more. This website was created with <e>Responsive web design</e> approach, which ensures that the platform is displayed properly across all screen sizes.</p><p>The admin panel allows the administrator to manage the content on the platform. Only user with specific permissions can access it, and such an account can perform a wide variety of different actions. For example, administrator can view user reports and decide, wether reported content is against platform’s terms of service. Additionally, the administrator can manage users, apply penalties, or fully remove them from the platform.</p>"
    },
    "digit-recognition": {
      "tags": ["TensorFlow 2.0", "Keras", "Flask", "React.js"],
      "youtube-id": "9O2xwYOn2Fk",
      "title": "Digit recognition",
      "github-link": "https://github.com/arturpietrzak/EngineeringThesis",
      "description": "<p>Digit recognition system trained using MNIST database. The machine learning was built with <e>TensorFlow 2.0</e> and <e>Keras</e> libraries and it uses <e>Convolutional Neural Network</e>. The model has achieved an accuracy of 98.84%.</p><p>Additionally, the model has been attached to simple <e>Flask</e> backend, which in combination with interactive <e>React.js</e> canvas allows anyone to test out the model with their own writing.</p>"
    },
    "personal-website": {
      "tags": ["React.js", "Next.js", "Framer Motion"],
      "youtube-id": "963i356ORuA",
      "title": "This personal website",
      "github-link": "https://github.com/arturpietrzak/EngineeringThesis",
      "description": "<p>This personal website was created as a portfolio to showcase my works. The backbone of this project is <e>Next.js</e>, which offers many useful features, such as <e>Search Engine Optimization</e> and <e>Server Side Rendering</e>. This website was styled using <e>SCSS modules</e> and the animations were implemented with <e>Framer Motion</e>. Additionally, this project utilizes <e>Next-intl</e> library, which enabled me to implement internationalization of the website.</p>"
    },
    "racetrack-ranking": {
      "tags": [
        "Express.js",
        "REST API",
        "HTML",
        "CSS",
        "JavaScript",
        "EJS",
        "MongoDB"
      ],
      "youtube-id": "quTyiQna948",
      "title": "Racetrack ranking platform",
      "github-link": "https://github.com/arturpietrzak/EngineeringThesis",
      "description": "<p>Web platform for browsing and reviewing different racetracks around the world. Backend was implemented with <e>Express.js</e>, and the data was persisted in <e>MongoDB</e> database. The user inteface was implemented in <e>HTML</e> and <e>CSS</e> with the <e>EJS</e> templating language. This website was created with <e>Responsive web design</e> approach, which ensures that the platform is displayed properly across all screen sizes.</p>"
    },
    "weather-app": {
      "tags": ["HTML", "CSS", "JavaScript", "Axios", "REST API"],
      "youtube-id": "V0cUO22DN4I",
      "title": "Weather app",
      "github-link": "https://github.com/arturpietrzak/EngineeringThesis",
      "description": "<p>Weather web app implemented in <e>React.js</e> inspired by iOS weather application. It utilizes <e>Axios</e> library to fetch data from <e>Visual Crossing weather data API</e>. The colors for daily temperature bars were implementing by manipulating the hue of <e>HSL</e> color model.</p>"
    },
    "commutely": {
      "tags": ["Bootstrap", "HTML", "CSS", "JavaScript"],
      "youtube-id": "Q0WIzLK-NCo",
      "title": "Commutely",
      "github-link": "https://github.com/arturpietrzak/EngineeringThesis",
      "description": "<p>Web calculator created with <e>Bootstrap</e>, <e>HTML</e>, <e>CSS</e> and <e>JavaScript</e>. It helps to inform people on the emissions that they produce while commuting to shool or work. Additionaly, it provides an estimate on how much money can be saved daily by using public transport.</p>"
    }
  }
}
